package com.study.springboot;

public class MyController {

	//수정작업 -> 
	   
	//Git Test
	   
	// Git 장점
	// 1. 소스 안전 관리
	// 2. 히스토리 관리 가능 - 수정/추가/삭제/변경 기록이 다 남음
	// 3. 팀 작업 용이
	   
	// clone : 복제 (서버 저장소를 로컬에 복제함)
	// master : 최상위 소스노드
	// breanch : 가치치기( 중간에
	   
	// 프로젝트소스 폴더
	//	          |    ^ 
	//   commit   v    | fetch
	// 로컬(내pc) 저장소
	//      |    ^
	// push v    | pull
	// 원격저장소(Github 서버) 
	
	// commit : 로컬저장소에 저장, 즉각 저장용도.
	// push : 서버에 올리는 것, 빌드오류가 없는 것을 올림.
	
	// 1. 
	// 같은 폴더나 파일을 개발자 A, B 동시에 수정하는 일을 줄여야
	// 충돌(Comflict)를 없앨 수 있다.
	// 개발자 간에 의사소통을 통해서 동시 편집을 안해야 됨.
	// 꼭 같은 파일이나 폴더를 수정해야 한다면 개발자 A가 Push 하고 개발자 B가 pull 한다.
	// pull 하기 전에 개발자 A는 대기하고 있다가, 개발자 B가 push 하고 나서 pull 한 다음에 작업을 진행하면 된다.
	
	// 2.
	// 개발자는 push하고 나면 꼭 팀원들에게 공지하고,
	// 팀원들이 빨리 pull해서 빌드해보고 문제없는 지 확인하고, 다음 작업을 진행하면 됨.
	// * 먼저 push 한 사람이 장땡이다
	
	
	// 수정수정
	// 수정 추가
	
	
}
